RhinoInside.Revit API Documentation
GeometryDecoder.ToBoundingBox Method
Overload List
Name | Description
ToBoundingBox(BoundingBoxXYZ)
 Converts the specified Autodesk.Revit.DB.BoundingBoxXYZ to an equivalent Rhino.Geometry.BoundingBox.
ToBoundingBox(Outline)
 Converts the specified Autodesk.Revit.DB.Outline to an equivalent Rhino.Geometry.BoundingBox.
ToBoundingBox(BoundingBoxXYZ, Transform)
 Converts the specified Autodesk.Revit.DB.BoundingBoxXYZ to an equivalent Rhino.Geometry.BoundingBox and outputs the conversion transform.
Top
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace